-- Заполнение данными 

use `my_db`;

-- INSERT INTO `my_db`.`insurance_type` (`insurance_type`, `rate`) VALUES ('gjk', '7');

insert into `Insurance_type` (`insurance_type`, `rate`) values
('Страхование грузов', 2)
,('Страхование жизни', 1)
,('Страхваоние имущества', 3)
,('Страхование финансов', 4)
,('Страхование авто', 5);

insert into `Customers` (`surname_customers`, `name_customers`, `patronymic_customers`, `passport_ciustomers`, `customer_discount`) values
('Рзаева', 'Маргарита', 'Григорьевна', 'ВК 4590', 0.2)
,('Веселков', 'Евсей', 'Ярославович', 'ИМ 1234', 0.1)
,('Русин', 'Василий', 'Петрович', 'ПА 8942', 0.5)
,('Воронец', 'Розалия', 'Дмитриевна', 'ПР 4365', 0.2)
,('Семёнова', 'Октябрина', 'Петровна', 'ШП 3012', 0.3)
,('Борисова', 'Маргарита', 'Леонидовна', 'ВС 2640', 0.3)
,('Карпова', 'Анастасия', 'Робертовна', 'ПА 2390', 0.1 );

insert into `Insurance_Agents` (`surname_agent`, `name_agent`, `patronymic_agent`, `agent_percent`) values
('Муравьев', 'Борис', 'Николаевич', 10)
,('Зайцева', 'Мариетта', 'Семеновна', 45 )
,('Морозов', 'Ярополк', 'Станиславович', 28)
,('Журавлёв', 'Болеслав', 'Тимофеевич', 15)
,('Лютов', 'Аким', 'Викторович', 40)
,('Сысолятина', 'Любава', 'Тимофеевна', 10);

insert into `Contracts` (`id_customers`, `id_agent`, `id_insurance_type`, `insurance_amount`, `date`) values
(1, 1, 1, 150000, 2018-12-12)
,(2, 1, 2, 70000, 2018-12-15)
,(3, 2, 5, 190000, 2018-10-01)
,(4, 3, 3, 450000, 2018-12-01)
,(5, 5, 2, 290000, 2018-12-08)
,(6, 4, 4, 50000, 2018-12-08)
,(7, 6, 5, 50000,  2018-12-12);

