use car_rental;

insert into color (color) values
	("Красный")
    ,("Черный")
    ,("Белый")
    ,("Серый")
    ,("Синий")
    ,("Голубой")
    ,("Желтый")
    ,("Вишневый")
    ,("Зелёный")
    ,("Фиолетовый");
    
insert into model_car (model) values
	("Toyota Camry")
    ,("Volkswagen Touareg")
    ,("Renault Logan")
    ,("Mercedes-Benz C-Класс")
    ,("Mitsubishi Outlander")
    ,("Hyundai Santa Fe")
    ,("BMW X4")
    ,("Audi RS 4")
    ,("Citroen C3 AirCross")
    ,("Citroen SpaceTourer");
  
insert into clients (surname, name, patronymic, passport) values
	("Демьянова", "Василиса", "Романовна", "КА 234547")
    ,("Романова", "Роза", "Даниловна", "ВА 4569872")
    ,("Ахметзянова", "Любомила", "Вячеславовна", "ОР 254103")
    ,("Константинова", "Леокадия", "Тарасовна", "ВУ 7921045")
    ,("Чапко", "Василиса", "Робертовна", "ЛО 746320")
    ,("Петров", "Пахом", "Михайлович", "ПР 456329")
    ,("Баранова", "Станислава", "Алексеевна", "НЕ 563256")
    ,("Антонова", "Лукерья", "Антоновна", "СА 012589")
    ,("Быков", "Алексей", "Русланович", "КЕ 451278")
    ,("Лютова", "Инга", "Вячеславовна", "ПА 896523")
    ,("Давыдова", "Анастасия", "Егоровна", "УК 325487")
    ,("Алексеев", "Сила", "Григорьевич", "СМ 852563")
    ,("Константинова", "Анна", "Петровна", "АМ 587456")
    ,("Лапина", "Джульетта", "Егоровна", "АО 030201")
    ,("Холодкова", "Светлана", "Эдуардовна", "ПИ 237812");
    
insert into car (id_model_car, id_color, year, gos_nomer, insurance_value, cost_one_day) values
	(5, 4, 2005, "АК 4567 ПР", 150000, 5000)
    ,(2, 2, 2009, "ПР 4589 КЕ", 140000, 4500)
    ,(1, 5, 2012, "АН 1234 КЕ", 200000, 7200)
    ,(10, 4, 2015, "АН 9874 ПР", 180000, 6800)
    ,(1, 9, 2010, "АН 1209 ПА", 212000, 6500)
    ,(3, 3, 2009, "АН 0909 ПР", 200000, 6450)
    ,(7, 6, 2009, "АН 4567 АП", 290000, 9000)
    ,(10, 2, 2008, "АН 4433 ЕН", 120000, 4500)
    ,(4, 1, 2010, "АН 6677 ПА", 149000, 5000)
    ,(8, 2, 2011, "АН 2233 ЕН", 211000, 5200)
    ,(1, 6, 2004, "АН 0099 ЕК", 208000, 5400)
    ,(9, 8, 2016, "АН 3409 ЕН", 200000, 6000)
    ,(6, 6, 2015, "АН 1100 КЕ", 210000, 5900)
    ,(9, 4, 2014, "АН 2299 ПР", 208000, 5450)
    ,(1, 8, 2014, "АН 0001 АП", 260000, 8000);
    
insert into rental (id_client, id_car, start_dat, count_day) values
	(1, 5, '2018-12-05', 10)
    ,(2, 3, '2018-11-15', 5)
    ,(15, 12, '2018-12-01', 12)
    ,(9, 9, '2018-12-02', 8)
    ,(5, 2, '2018-12-15', 3)
    ,(3, 4, '2018-12-11', 4)
    ,(4, 1, '2018-11-28', 16)
    ,(7, 7, '2018-12-12', 14)
    ,(6, 6, '2018-11-14', 10)
    ,(8, 2, '2018-12-09', 8)
    ,(10, 10, '2018-11-22', 2)
    ,(11, 11, '2018-12-01', 18)
    ,(12, 13, '2018-12-02', 5)
    ,(13, 4, '2018-12-25', 4)
    ,(14, 14, '2018-12-20', 9);
    
	